Revit 2027 API
BaseArray.GetOriginalMemberIds Method
Retrieves the original member Ids of the Array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract ICollection<ElementId> GetOriginalMemberIds()
Public MustOverride Function GetOriginalMemberIds As ICollection(Of ElementId)
public:
virtual ICollection<ElementId^>^ GetOriginalMemberIds() abstract
abstract GetOriginalMemberIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The original member Ids of the Array
See Also
Reference
BaseArray Class
Autodesk.Revit.DB Namespace